<?php

namespace Database\Seeders;

use App\Models\LawyerBlog;
use Illuminate\Database\Seeder;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class LawyerBlogSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        // LawyerBlog::factory()->count(100)->create();

        $blogs = [
            [
                'lawyer_id' => 2,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 2,
                'title' => "قانون رقم 28.08 بتعديل القانون المنظم لمهنة المحاماة",
                'body' => "
                المادة 1
                المحاماة مهنة حرة، مستقلة، تساعد القضاء، وتساهم في تحقيق العدالة، والمحامون بهذا الاعتبار جزء من أسرة القضاء.
                المادة 2
                لا تجوز ممارسة مهنة المحاماة، وتحمل أعبائها، والتمتع بامتيازاتها، والقيام بمهامها، إلا لمحام مسجل بجدول إحدى هيئات المحامين بالمغرب أو محام متمرن مقيد بلائحة التمرين لدى إحدى الهيئات المذكورة.
                تمارس مهنة المحاماة، طبقا لمقتضيات هذا القانون، مع مراعاة الحقوق المكتسبة.
                المادة 3
                يتقيد المحامي في سلوكه المهني بمبادئ الاستقلال والتجرد والنزاهة والكرامة والشرف، وما تقتضيه الأخلاق الحميدة وأعراف وتقاليد المهنة.
                المادة 4
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 2,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],

            [
                'lawyer_id' => 3,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 3,
                'title' => "قانون رقم 28.08 بتعديل القانون المنظم لمهنة المحاماة",
                'body' => "
                المادة 1
                المحاماة مهنة حرة، مستقلة، تساعد القضاء، وتساهم في تحقيق العدالة، والمحامون بهذا الاعتبار جزء من أسرة القضاء.
                المادة 2
                لا تجوز ممارسة مهنة المحاماة، وتحمل أعبائها، والتمتع بامتيازاتها، والقيام بمهامها، إلا لمحام مسجل بجدول إحدى هيئات المحامين بالمغرب أو محام متمرن مقيد بلائحة التمرين لدى إحدى الهيئات المذكورة.
                تمارس مهنة المحاماة، طبقا لمقتضيات هذا القانون، مع مراعاة الحقوق المكتسبة.
                المادة 3
                يتقيد المحامي في سلوكه المهني بمبادئ الاستقلال والتجرد والنزاهة والكرامة والشرف، وما تقتضيه الأخلاق الحميدة وأعراف وتقاليد المهنة.
                المادة 4
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 3,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],

            [
                'lawyer_id' => 4,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 4,
                'title' => "قانون رقم 28.08 بتعديل القانون المنظم لمهنة المحاماة",
                'body' => "
                المادة 1
                المحاماة مهنة حرة، مستقلة، تساعد القضاء، وتساهم في تحقيق العدالة، والمحامون بهذا الاعتبار جزء من أسرة القضاء.
                المادة 2
                لا تجوز ممارسة مهنة المحاماة، وتحمل أعبائها، والتمتع بامتيازاتها، والقيام بمهامها، إلا لمحام مسجل بجدول إحدى هيئات المحامين بالمغرب أو محام متمرن مقيد بلائحة التمرين لدى إحدى الهيئات المذكورة.
                تمارس مهنة المحاماة، طبقا لمقتضيات هذا القانون، مع مراعاة الحقوق المكتسبة.
                المادة 3
                يتقيد المحامي في سلوكه المهني بمبادئ الاستقلال والتجرد والنزاهة والكرامة والشرف، وما تقتضيه الأخلاق الحميدة وأعراف وتقاليد المهنة.
                المادة 4
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 4,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],

            [
                'lawyer_id' => 5,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 5,
                'title' => "قانون رقم 28.08 بتعديل القانون المنظم لمهنة المحاماة",
                'body' => "
                المادة 1
                المحاماة مهنة حرة، مستقلة، تساعد القضاء، وتساهم في تحقيق العدالة، والمحامون بهذا الاعتبار جزء من أسرة القضاء.
                المادة 2
                لا تجوز ممارسة مهنة المحاماة، وتحمل أعبائها، والتمتع بامتيازاتها، والقيام بمهامها، إلا لمحام مسجل بجدول إحدى هيئات المحامين بالمغرب أو محام متمرن مقيد بلائحة التمرين لدى إحدى الهيئات المذكورة.
                تمارس مهنة المحاماة، طبقا لمقتضيات هذا القانون، مع مراعاة الحقوق المكتسبة.
                المادة 3
                يتقيد المحامي في سلوكه المهني بمبادئ الاستقلال والتجرد والنزاهة والكرامة والشرف، وما تقتضيه الأخلاق الحميدة وأعراف وتقاليد المهنة.
                المادة 4
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 5,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],

            [
                'lawyer_id' => 6,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 6,
                'title' => "قانون رقم 28.08 بتعديل القانون المنظم لمهنة المحاماة",
                'body' => "
                المادة 1
                المحاماة مهنة حرة، مستقلة، تساعد القضاء، وتساهم في تحقيق العدالة، والمحامون بهذا الاعتبار جزء من أسرة القضاء.
                المادة 2
                لا تجوز ممارسة مهنة المحاماة، وتحمل أعبائها، والتمتع بامتيازاتها، والقيام بمهامها، إلا لمحام مسجل بجدول إحدى هيئات المحامين بالمغرب أو محام متمرن مقيد بلائحة التمرين لدى إحدى الهيئات المذكورة.
                تمارس مهنة المحاماة، طبقا لمقتضيات هذا القانون، مع مراعاة الحقوق المكتسبة.
                المادة 3
                يتقيد المحامي في سلوكه المهني بمبادئ الاستقلال والتجرد والنزاهة والكرامة والشرف، وما تقتضيه الأخلاق الحميدة وأعراف وتقاليد المهنة.
                المادة 4
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 6,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],

            [
                'lawyer_id' => 7,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 7,
                'title' => "قانون رقم 28.08 بتعديل القانون المنظم لمهنة المحاماة",
                'body' => "
                المادة 1
                المحاماة مهنة حرة، مستقلة، تساعد القضاء، وتساهم في تحقيق العدالة، والمحامون بهذا الاعتبار جزء من أسرة القضاء.
                المادة 2
                لا تجوز ممارسة مهنة المحاماة، وتحمل أعبائها، والتمتع بامتيازاتها، والقيام بمهامها، إلا لمحام مسجل بجدول إحدى هيئات المحامين بالمغرب أو محام متمرن مقيد بلائحة التمرين لدى إحدى الهيئات المذكورة.
                تمارس مهنة المحاماة، طبقا لمقتضيات هذا القانون، مع مراعاة الحقوق المكتسبة.
                المادة 3
                يتقيد المحامي في سلوكه المهني بمبادئ الاستقلال والتجرد والنزاهة والكرامة والشرف، وما تقتضيه الأخلاق الحميدة وأعراف وتقاليد المهنة.
                المادة 4
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 7,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],

            [
                'lawyer_id' => 8,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 8,
                'title' => "قانون رقم 28.08 بتعديل القانون المنظم لمهنة المحاماة",
                'body' => "
                المادة 1
                المحاماة مهنة حرة، مستقلة، تساعد القضاء، وتساهم في تحقيق العدالة، والمحامون بهذا الاعتبار جزء من أسرة القضاء.
                المادة 2
                لا تجوز ممارسة مهنة المحاماة، وتحمل أعبائها، والتمتع بامتيازاتها، والقيام بمهامها، إلا لمحام مسجل بجدول إحدى هيئات المحامين بالمغرب أو محام متمرن مقيد بلائحة التمرين لدى إحدى الهيئات المذكورة.
                تمارس مهنة المحاماة، طبقا لمقتضيات هذا القانون، مع مراعاة الحقوق المكتسبة.
                المادة 3
                يتقيد المحامي في سلوكه المهني بمبادئ الاستقلال والتجرد والنزاهة والكرامة والشرف، وما تقتضيه الأخلاق الحميدة وأعراف وتقاليد المهنة.
                المادة 4
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 8,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],

            [
                'lawyer_id' => 9,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 9,
                'title' => "قانون رقم 28.08 بتعديل القانون المنظم لمهنة المحاماة",
                'body' => "
                المادة 1
                المحاماة مهنة حرة، مستقلة، تساعد القضاء، وتساهم في تحقيق العدالة، والمحامون بهذا الاعتبار جزء من أسرة القضاء.
                المادة 2
                لا تجوز ممارسة مهنة المحاماة، وتحمل أعبائها، والتمتع بامتيازاتها، والقيام بمهامها، إلا لمحام مسجل بجدول إحدى هيئات المحامين بالمغرب أو محام متمرن مقيد بلائحة التمرين لدى إحدى الهيئات المذكورة.
                تمارس مهنة المحاماة، طبقا لمقتضيات هذا القانون، مع مراعاة الحقوق المكتسبة.
                المادة 3
                يتقيد المحامي في سلوكه المهني بمبادئ الاستقلال والتجرد والنزاهة والكرامة والشرف، وما تقتضيه الأخلاق الحميدة وأعراف وتقاليد المهنة.
                المادة 4
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 9,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],

            [
                'lawyer_id' => 10,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 10,
                'title' => "قانون رقم 28.08 بتعديل القانون المنظم لمهنة المحاماة",
                'body' => "
                المادة 1
                المحاماة مهنة حرة، مستقلة، تساعد القضاء، وتساهم في تحقيق العدالة، والمحامون بهذا الاعتبار جزء من أسرة القضاء.
                المادة 2
                لا تجوز ممارسة مهنة المحاماة، وتحمل أعبائها، والتمتع بامتيازاتها، والقيام بمهامها، إلا لمحام مسجل بجدول إحدى هيئات المحامين بالمغرب أو محام متمرن مقيد بلائحة التمرين لدى إحدى الهيئات المذكورة.
                تمارس مهنة المحاماة، طبقا لمقتضيات هذا القانون، مع مراعاة الحقوق المكتسبة.
                المادة 3
                يتقيد المحامي في سلوكه المهني بمبادئ الاستقلال والتجرد والنزاهة والكرامة والشرف، وما تقتضيه الأخلاق الحميدة وأعراف وتقاليد المهنة.
                المادة 4
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 10,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],

            [
                'lawyer_id' => 3,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 3,
                'title' => "قانون رقم 28.08 بتعديل القانون المنظم لمهنة المحاماة",
                'body' => "
                المادة 1
                المحاماة مهنة حرة، مستقلة، تساعد القضاء، وتساهم في تحقيق العدالة، والمحامون بهذا الاعتبار جزء من أسرة القضاء.
                المادة 2
                لا تجوز ممارسة مهنة المحاماة، وتحمل أعبائها، والتمتع بامتيازاتها، والقيام بمهامها، إلا لمحام مسجل بجدول إحدى هيئات المحامين بالمغرب أو محام متمرن مقيد بلائحة التمرين لدى إحدى الهيئات المذكورة.
                تمارس مهنة المحاماة، طبقا لمقتضيات هذا القانون، مع مراعاة الحقوق المكتسبة.
                المادة 3
                يتقيد المحامي في سلوكه المهني بمبادئ الاستقلال والتجرد والنزاهة والكرامة والشرف، وما تقتضيه الأخلاق الحميدة وأعراف وتقاليد المهنة.
                المادة 4
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 3,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],

            // -----------------------
            [
                'lawyer_id' => 12,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 12,
                'title' => "قانون رقم 28.08 بتعديل القانون المنظم لمهنة المحاماة",
                'body' => "
                المادة 1
                المحاماة مهنة حرة، مستقلة، تساعد القضاء، وتساهم في تحقيق العدالة، والمحامون بهذا الاعتبار جزء من أسرة القضاء.
                المادة 2
                لا تجوز ممارسة مهنة المحاماة، وتحمل أعبائها، والتمتع بامتيازاتها، والقيام بمهامها، إلا لمحام مسجل بجدول إحدى هيئات المحامين بالمغرب أو محام متمرن مقيد بلائحة التمرين لدى إحدى الهيئات المذكورة.
                تمارس مهنة المحاماة، طبقا لمقتضيات هذا القانون، مع مراعاة الحقوق المكتسبة.
                المادة 3
                يتقيد المحامي في سلوكه المهني بمبادئ الاستقلال والتجرد والنزاهة والكرامة والشرف، وما تقتضيه الأخلاق الحميدة وأعراف وتقاليد المهنة.
                المادة 4
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
            [
                'lawyer_id' => 12,
                'title' => "النظام الداخلي لهيئة المحامين بمراكش",
                'body' => "
                طيلة العمل بالنظام الداخلي في إطار القانون رقم 28.08 المنظم لمهنة المحاماة ولمدة تزيد على سبع سنوات تأكد من خلال تطبيقه ضرورة مراجعة شاملة ودقيقة سدا للثغرات الموجودة به وقطعا لأي تأويل أو تفسير لا يتلاءم والنص الأصل .
                وتطبيقا لمقتضيات المادة 91 من القانون رقم 28.08  المتعلق بتعديل القانون المنظم لمهنة المحاماة  الصادر بتنفيذه الظهير الشريف رقم 101-08-1 بتاريخ 20 من شوال  1429 الموافق 20 أكتوبر 2008 .
                و كذا القانون رقم 29.08 المنظم للشركات المدنية المهنية للمحاماة الصادر بتنفيذه الظهير الشريف رقم 102-08-1 بتاريخ 20 من شوال الموافق 20 أكتوبر 2008 .
                ",
                'image_link' => 'assets/main/default/img/blog-1.png',
                'is_published' => 1,
                'is_approved' => 1
            ],
        ];

        foreach ($blogs as $blog) {
            LawyerBlog::create($blog);
        }
        //
    }
}
