<?php


return [
    "Dashboard" => "لوحة القيادة",
    "Blogs" => "المدونات",
    "ListBlogs" => "قائمة المدونات",
    "AddBlog" => "أضف مدونة",

    "FAQ" => "الأسئلة و الاجوب",
    "ListFAQ" => "قائمة الأسئلة والأجوبة ",
    "AddFAQ" => "أضف الأسئلة و الاجوب",

    "Mails" => "رسائل البريد الإلكتروني",
    "ListMails" => "قائمة رسائل البريد الإلكتروني",

    "Settings" => "إعدادات",
    "Profile" => "اعدادات الحساب",
    "Competencies" => "الكفاءات",
    "PageDestination" => "الصفحة الرئيسية" ,
    "PageFooter"  => "معلومات الاتصال",
    "Models" =>  "نماذج",

    "AddModel" => " انشاء نموذج",

    "ListModels" =>  "قائمة نماذج"
];


