<?php


return [
    'NomFR' => 'الاسم بالفرنسية',
    'PrenomFR' => 'الاسم الأول بالفرنسية',
    'NomAR' => 'الاسم بالعربي',
    'PrenomAR' => 'الاسم الاول باللغة العربية',
    'OldPass' => 'كلمة المرور القديمة',
    'NewPass' => 'كلمة مرور جديدة',
    'ConfPass' => 'تأكيد كلمة السر',
    'SelectImg' => 'اختر الصورة',
    'BioFR' => 'سيرة ذاتية باللغة الفرنسية',
    'BioAR' => 'سيرة ذاتية باللغة العربية',
    'NumTel' => 'رقم الهاتف',
    'Address' => 'عنوان',
    'LienGoogleMaps' => 'رابط خرائط جوجل',
    'LienWhats' => 'رقم واتساب',
    'LienLinkedIn' => 'رابط LinkedIn',

    // --------------------------
    'Setting' => 'إعدادات',
    'ModifyProfile' => 'تعديل الملف الشخصي'


];
